package com.example.recyclevapp;

public class myData {

    static String[] nameArray = {
            "גדי נוימן", "דפנה נוימן", "מאיר נוימן",
            "בתיה נוימן", "מיקי ברנשטיין", "אורלי ברנשטיין",
            "בני קנובר", "מיכל זילברמן", "אהוד טל", "מיקי הגדול"
    };

    static String[] descriptionArray = {
            "הדמות הראשית, תסריטאי גרוש עם מבט ציני על החיים",
            "גרושתו של גדי, מורה לאמנות, אישה דעתנית וחזקה",
            "אביו של גדי, אדם מבוגר עם עצות קומיות ולא תמיד מועילות",
            "אמו של גדי, מעורבת בחייו של גדי יתר על המידה ודמות אימהית דומיננטית",
            "החבר הכי טוב של גדי, טיפוס אופטימי ומוזר אך תמיד תומך ונאמן",
            "אשתו של מיקי, דמות פיקחית ומלאת חיים עם נוכחות צבעונית",
            "הבוס של גדי בעבודה, טיפוס יהיר וגרוטסקי שגורם למבוכה ולצחוק",
            "החברה של גדי אחרי גירושיו מדפנה, צעירה ומקסימה שמביאה רוח רעננה לחייו",
            "מורה לריקוד, החבר של דפנה אחרי הגירושים מגדי, דמות אקסצנטרית",
            "תסריטאי נוסף במשרד של קנובר, נרקיסיסט שהיה בזוגיות סוערת עם אורלי"
    };



    static Integer[] drawableArray = {
            R.drawable.gadi, R.drawable.dafna, R.drawable.meir,
            R.drawable.batya, R.drawable.miki_b, R.drawable.orly_b,
            R.drawable.beni, R.drawable.michal, R.drawable.ehud, R.drawable.miki_gadol
    };

    static Integer[] id_ = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
}


